# Import and Export Files

# Challenge 0 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [ ]:
# I'm leaving the SQL labs for later

# Challenge 1 - Working with JSON files
Import the pandas library.

In [2]:
import pandas as pd

In the next cell, load the data in nasa.json in the data folder and load it into a pandas dataframe. Name the dataframe nasa.

In [6]:
nasa = pd.DataFrame(pd.read_json("nasa.json"))

Now that we have loaded the data, let's examine it using the head() function.

In [7]:
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

####  The value_counts() function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the value_counts() function to determine the frequency of all types of asteroid landings by applying the function to the fall column.

In [8]:
nasa.value_counts("fall")

fall
Fell     996
Found      4
dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the orient=records argument and name the file nasa-output.json. Remember to save the file inside the data folder.

In [9]:
nasa.to_json('nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [20]:
import pandas as pd

shuttle = pd.read_csv("astronaut.csv", sep=" ,", header=0, encoding='utf-8')
print(shuttle)

    Name\tYear\tGroup\tStatus\tBirth Date\tBirth Place\tGender\tAlma Mater\tUndergraduate Major\tGraduate Major\tMilitary Rank\tMilitary Branch\tSpace Flights\tSpace Flight (hr)\tSpace Walks\tSpace Walks (hr)\tMissions\tDeath Date\tDeath Mission
0    Joseph M. Acaba\t2004.0\t19.0\tActive\t1967-05...
1    Loren W. Acton\t\t\tRetired\t1936-03-07\tLewis...
2    James C. Adamson\t1984.0\t10.0\tRetired\t1946-...
3    Thomas D. Akers\t1987.0\t12.0\tRetired\t1951-0...
4    Buzz Aldrin\t1963.0\t3.0\tRetired\t1930-01-20\...
..                                                 ...
352  David A. Wolf\t1990.0\t13.0\tRetired\t1956-08-...
353  Neil W. Woodward III \t1998.0\t17.0\tRetired\t...
354  Alfred M. Worden\t1966.0\t5.0\tRetired\t1932-0...
355  John W. Young\t1962.0\t2.0\tRetired\t1930-09-2...
356  George D. Zamka\t1998.0\t17.0\tRetired\t1962-0...

[357 rows x 1 columns]

C:\Users\jsctr\AppData\Local\Temp\ipykernel_3136\963167532.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  shuttle = pd.read_csv("astronaut.csv", sep=" ,", header=0, encoding='utf-8')

In [21]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [8]:
# Your code here:

Let's verify that this worked by looking at the `head()` function.

In [22]:
shuttle.head()

  Name\tYear\tGroup\tStatus\tBirth Date\tBirth Place\tGender\tAlma Mater\tUndergraduate Major\tGraduate Major\tMilitary Rank\tMilitary Branch\tSpace Flights\tSpace Flight (hr)\tSpace Walks\tSpace Walks (hr)\tMissions\tDeath Date\tDeath Mission
0  Joseph M. Acaba\t2004.0\t19.0\tActive\t1967-05...
1  Loren W. Acton\t\t\tRetired\t1936-03-07\tLewis...
2  James C. Adamson\t1984.0\t10.0\tRetired\t1946-...
3  Thomas D. Akers\t1987.0\t12.0\tRetired\t1951-0...
4  Buzz Aldrin\t1963.0\t3.0\tRetired\t1930-01-20\...

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [24]:
shuttle.to_csv('shuttle.csv', sep=',',index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [25]:
astronaut = pd.read_excel("astronauts.xls")

Use the `head()` function to inspect the dataframe.

In [27]:
astronaut.head(2)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [29]:
astronaut.value_counts("Undergraduate Major")

Undergraduate Major
Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Marine Engineering & Nautical Science     1
Mathematical & Electrical Science         1
Biochemistry                              1
Mathematics & Economics                   1
Accounting                                1
Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [30]:
astronaut.to_csv('astronaut.csv', sep='t',index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [15]:
# Your code here: